{"backend": "tensorflow", "keras_version": "2.1.5", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 80, 80, 32], "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv3D", "config": {"filters": 16, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_1", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_1", "epsilon": 0.001}, "name": "batch_normalization_1", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_1", "trainable": true}, "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 16, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_2", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_2", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_2", "epsilon": 0.001}, "name": "batch_normalization_2", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_2", "trainable": true}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "SpatialDropout3D", "config": {"noise_shape": null, "trainable": true, "name": "spatial_dropout3d_1", "rate": 0.3, "seed": null}, "name": "spatial_dropout3d_1", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 16, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_3", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_3", "inbound_nodes": [[["spatial_dropout3d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_3", "epsilon": 0.001}, "name": "batch_normalization_3", "inbound_nodes": [[["conv3d_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_3", "trainable": true}, "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}], ["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 32, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [2, 2, 2], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_4", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_4", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_4", "epsilon": 0.001}, "name": "batch_normalization_4", "inbound_nodes": [[["conv3d_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_4", "trainable": true}, "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 32, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_5", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_5", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_5", "epsilon": 0.001}, "name": "batch_normalization_5", "inbound_nodes": [[["conv3d_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_5", "trainable": true}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "SpatialDropout3D", "config": {"noise_shape": null, "trainable": true, "name": "spatial_dropout3d_2", "rate": 0.3, "seed": null}, "name": "spatial_dropout3d_2", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 32, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_6", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_6", "inbound_nodes": [[["spatial_dropout3d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_6", "epsilon": 0.001}, "name": "batch_normalization_6", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_6", "trainable": true}, "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true}, "name": "add_2", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}], ["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 64, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [2, 2, 2], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_7", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_7", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_7", "epsilon": 0.001}, "name": "batch_normalization_7", "inbound_nodes": [[["conv3d_7", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_7", "trainable": true}, "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 64, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_8", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_8", "epsilon": 0.001}, "name": "batch_normalization_8", "inbound_nodes": [[["conv3d_8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_8", "trainable": true}, "name": "leaky_re_lu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "SpatialDropout3D", "config": {"noise_shape": null, "trainable": true, "name": "spatial_dropout3d_3", "rate": 0.3, "seed": null}, "name": "spatial_dropout3d_3", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 64, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_9", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_9", "inbound_nodes": [[["spatial_dropout3d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_9", "epsilon": 0.001}, "name": "batch_normalization_9", "inbound_nodes": [[["conv3d_9", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_9", "trainable": true}, "name": "leaky_re_lu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true}, "name": "add_3", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}], ["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 128, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [2, 2, 2], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_10", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_10", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_10", "epsilon": 0.001}, "name": "batch_normalization_10", "inbound_nodes": [[["conv3d_10", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_10", "trainable": true}, "name": "leaky_re_lu_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 128, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_11", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_11", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_11", "epsilon": 0.001}, "name": "batch_normalization_11", "inbound_nodes": [[["conv3d_11", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_11", "trainable": true}, "name": "leaky_re_lu_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "SpatialDropout3D", "config": {"noise_shape": null, "trainable": true, "name": "spatial_dropout3d_4", "rate": 0.3, "seed": null}, "name": "spatial_dropout3d_4", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 128, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_12", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_12", "inbound_nodes": [[["spatial_dropout3d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_12", "epsilon": 0.001}, "name": "batch_normalization_12", "inbound_nodes": [[["conv3d_12", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_12", "trainable": true}, "name": "leaky_re_lu_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true}, "name": "add_4", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}], ["leaky_re_lu_12", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 256, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [2, 2, 2], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_13", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_13", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_13", "epsilon": 0.001}, "name": "batch_normalization_13", "inbound_nodes": [[["conv3d_13", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_13", "trainable": true}, "name": "leaky_re_lu_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 256, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_14", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_14", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_14", "epsilon": 0.001}, "name": "batch_normalization_14", "inbound_nodes": [[["conv3d_14", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_14", "trainable": true}, "name": "leaky_re_lu_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "SpatialDropout3D", "config": {"noise_shape": null, "trainable": true, "name": "spatial_dropout3d_5", "rate": 0.3, "seed": null}, "name": "spatial_dropout3d_5", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 256, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_15", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_15", "inbound_nodes": [[["spatial_dropout3d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_15", "epsilon": 0.001}, "name": "batch_normalization_15", "inbound_nodes": [[["conv3d_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_15", "trainable": true}, "name": "leaky_re_lu_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true}, "name": "add_5", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}], ["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "UpSampling3D", "config": {"size": [2, 2, 2], "name": "up_sampling3d_1", "data_format": "channels_first", "trainable": true}, "name": "up_sampling3d_1", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 128, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_16", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_16", "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_16", "epsilon": 0.001}, "name": "batch_normalization_16", "inbound_nodes": [[["conv3d_16", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_16", "trainable": true}, "name": "leaky_re_lu_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["add_4", 0, 0, {}], ["leaky_re_lu_16", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 128, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_17", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_17", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_17", "epsilon": 0.001}, "name": "batch_normalization_17", "inbound_nodes": [[["conv3d_17", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_17", "trainable": true}, "name": "leaky_re_lu_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 128, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_18", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_18", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_18", "epsilon": 0.001}, "name": "batch_normalization_18", "inbound_nodes": [[["conv3d_18", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_18", "trainable": true}, "name": "leaky_re_lu_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "UpSampling3D", "config": {"size": [2, 2, 2], "name": "up_sampling3d_2", "data_format": "channels_first", "trainable": true}, "name": "up_sampling3d_2", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 64, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_19", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_19", "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_19", "epsilon": 0.001}, "name": "batch_normalization_19", "inbound_nodes": [[["conv3d_19", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_19", "trainable": true}, "name": "leaky_re_lu_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "inbound_nodes": [[["add_3", 0, 0, {}], ["leaky_re_lu_19", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 64, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_20", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_20", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_20", "epsilon": 0.001}, "name": "batch_normalization_20", "inbound_nodes": [[["conv3d_20", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_20", "trainable": true}, "name": "leaky_re_lu_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 64, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_21", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_21", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_21", "epsilon": 0.001}, "name": "batch_normalization_21", "inbound_nodes": [[["conv3d_21", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_21", "trainable": true}, "name": "leaky_re_lu_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "UpSampling3D", "config": {"size": [2, 2, 2], "name": "up_sampling3d_3", "data_format": "channels_first", "trainable": true}, "name": "up_sampling3d_3", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 32, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_23", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_23", "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_22", "epsilon": 0.001}, "name": "batch_normalization_22", "inbound_nodes": [[["conv3d_23", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_22", "trainable": true}, "name": "leaky_re_lu_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_3", "trainable": true}, "name": "concatenate_3", "inbound_nodes": [[["add_2", 0, 0, {}], ["leaky_re_lu_22", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 32, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_24", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_24", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_23", "epsilon": 0.001}, "name": "batch_normalization_23", "inbound_nodes": [[["conv3d_24", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_23", "trainable": true}, "name": "leaky_re_lu_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 32, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_25", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_25", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_24", "epsilon": 0.001}, "name": "batch_normalization_24", "inbound_nodes": [[["conv3d_25", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_24", "trainable": true}, "name": "leaky_re_lu_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "UpSampling3D", "config": {"size": [2, 2, 2], "name": "up_sampling3d_4", "data_format": "channels_first", "trainable": true}, "name": "up_sampling3d_4", "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 16, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_27", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_27", "inbound_nodes": [[["up_sampling3d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_25", "epsilon": 0.001}, "name": "batch_normalization_25", "inbound_nodes": [[["conv3d_27", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_25", "trainable": true}, "name": "leaky_re_lu_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_4", "trainable": true}, "name": "concatenate_4", "inbound_nodes": [[["add_1", 0, 0, {}], ["leaky_re_lu_25", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 16, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_28", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_28", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_26", "epsilon": 0.001}, "name": "batch_normalization_26", "inbound_nodes": [[["conv3d_28", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_26", "trainable": true}, "name": "leaky_re_lu_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 4, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "valid", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_22", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_22", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 16, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "same", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_29", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_29", "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]]}, {"class_name": "UpSampling3D", "config": {"size": [2, 2, 2], "name": "up_sampling3d_5", "data_format": "channels_first", "trainable": true}, "name": "up_sampling3d_5", "inbound_nodes": [[["conv3d_22", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 4, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "valid", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_26", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_26", "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "axis": 1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "name": "batch_normalization_27", "epsilon": 0.001}, "name": "batch_normalization_27", "inbound_nodes": [[["conv3d_29", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true}, "name": "add_6", "inbound_nodes": [[["up_sampling3d_5", 0, 0, {}], ["conv3d_26", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_27", "trainable": true}, "name": "leaky_re_lu_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "UpSampling3D", "config": {"size": [2, 2, 2], "name": "up_sampling3d_6", "data_format": "channels_first", "trainable": true}, "name": "up_sampling3d_6", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"filters": 4, "activation": "linear", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1, 1], "padding": "valid", "bias_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "name": "conv3d_30", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "name": "conv3d_30", "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true}, "name": "add_7", "inbound_nodes": [[["up_sampling3d_6", 0, 0, {}], ["conv3d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["add_7", 0, 0, {}]]]}]}, "class_name": "Model"}