{"keras_version": "2.1.5", "class_name": "Model", "config": {"output_layers": [["activation_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 80, 80, 32], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv3d_1", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_1", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_1", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv3d_2", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_2", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_2", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "spatial_dropout3d_1", "class_name": "SpatialDropout3D", "config": {"name": "spatial_dropout3d_1", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["spatial_dropout3d_1", 0, 0, {}]]], "name": "conv3d_3", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_3", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_3", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}], ["leaky_re_lu_3", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv3d_4", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_4", "strides": [2, 2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_4", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv3d_5", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_5", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_5", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "spatial_dropout3d_2", "class_name": "SpatialDropout3D", "config": {"name": "spatial_dropout3d_2", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["spatial_dropout3d_2", 0, 0, {}]]], "name": "conv3d_6", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_6", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_6", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}], ["leaky_re_lu_6", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv3d_7", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_7", "strides": [2, 2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_7", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv3d_8", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_8", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_8", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_8", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "spatial_dropout3d_3", "class_name": "SpatialDropout3D", "config": {"name": "spatial_dropout3d_3", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["spatial_dropout3d_3", 0, 0, {}]]], "name": "conv3d_9", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_9", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_9", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_9", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}], ["leaky_re_lu_9", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv3d_10", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_10", "strides": [2, 2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_10", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_10", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "conv3d_11", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_11", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_11", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_11", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "spatial_dropout3d_4", "class_name": "SpatialDropout3D", "config": {"name": "spatial_dropout3d_4", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["spatial_dropout3d_4", 0, 0, {}]]], "name": "conv3d_12", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_12", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_12", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_12", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}], ["leaky_re_lu_12", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv3d_13", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_13", "strides": [2, 2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_13", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_13", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "conv3d_14", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_14", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_14", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_14", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "leaky_re_lu_14", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "spatial_dropout3d_5", "class_name": "SpatialDropout3D", "config": {"name": "spatial_dropout3d_5", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["spatial_dropout3d_5", 0, 0, {}]]], "name": "conv3d_15", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_15", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_15", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_15", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "leaky_re_lu_15", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}], ["leaky_re_lu_15", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "up_sampling3d_1", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_1", "size": [2, 2, 2], "data_format": "channels_first", "trainable": true}}, {"inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "name": "conv3d_16", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_16", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_16", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_16", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "leaky_re_lu_16", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}], ["leaky_re_lu_16", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv3d_17", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_17", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_17", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_17", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "leaky_re_lu_17", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "name": "conv3d_18", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_18", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_18", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_18", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "leaky_re_lu_18", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "name": "up_sampling3d_2", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_2", "size": [2, 2, 2], "data_format": "channels_first", "trainable": true}}, {"inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "name": "conv3d_19", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_19", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_19", 0, 0, {}]]], "name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_19", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}], ["leaky_re_lu_19", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv3d_20", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_20", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_20", 0, 0, {}]]], "name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_20", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]], "name": "conv3d_21", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_21", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_21", 0, 0, {}]]], "name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_21", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "leaky_re_lu_21", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "name": "up_sampling3d_3", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_3", "size": [2, 2, 2], "data_format": "channels_first", "trainable": true}}, {"inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "name": "conv3d_23", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_23", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_23", 0, 0, {}]]], "name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_22", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "leaky_re_lu_22", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}], ["leaky_re_lu_22", 0, 0, {}]]], "name": "concatenate_3", "class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_3", "trainable": true}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv3d_24", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_24", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_24", 0, 0, {}]]], "name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_23", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "leaky_re_lu_23", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]], "name": "conv3d_25", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_25", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_25", 0, 0, {}]]], "name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_24", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "leaky_re_lu_24", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]], "name": "up_sampling3d_4", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_4", "size": [2, 2, 2], "data_format": "channels_first", "trainable": true}}, {"inbound_nodes": [[["up_sampling3d_4", 0, 0, {}]]], "name": "conv3d_27", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_27", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_27", 0, 0, {}]]], "name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_25", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "leaky_re_lu_25", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}], ["leaky_re_lu_25", 0, 0, {}]]], "name": "concatenate_4", "class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_4", "trainable": true}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv3d_28", "class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_28", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_28", 0, 0, {}]]], "name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_26", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "leaky_re_lu_26", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "name": "conv3d_22", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_22", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 4, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]], "name": "conv3d_29", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_29", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_22", 0, 0, {}]]], "name": "up_sampling3d_5", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_5", "size": [2, 2, 2], "data_format": "channels_first", "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]], "name": "conv3d_26", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_26", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 4, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["conv3d_29", 0, 0, {}]]], "name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "trainable": true, "name": "batch_normalization_27", "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["up_sampling3d_5", 0, 0, {}], ["conv3d_26", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "alpha": 0.30000001192092896, "trainable": true}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "up_sampling3d_6", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_6", "size": [2, 2, 2], "data_format": "channels_first", "trainable": true}}, {"inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]], "name": "conv3d_30", "class_name": "Conv3D", "config": {"kernel_size": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "name": "conv3d_30", "strides": [1, 1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 4, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"inbound_nodes": [[["up_sampling3d_6", 0, 0, {}], ["conv3d_30", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}